"""
Ⅰ. 신경망의 기초 - 인공지능과 기계학습 소개

인공지능의 요소 기술 중 머신러닝. → 딥러닝은 머신러닝 종류 중 하나이다.

일상 속 인공지능

1. 음성인식
2. 추천시스템
3. 자율주행
4. 실시간 객체인식(Face ID)
5. 로봇
6. 번역

Ⅱ. 신경망의 기초 - 기계학습 1

-사람/동물의 학습
예) 수학,과학, 역사 등 사거영역 + 수영,자전거 타기 등 행위 영영 포함
예) 파블로프의 개 샐험

-기계 학습
기계도 학습이 가능한가?
경험을 통해 점진적으로 성능이 향상되는 기계를 만들 수 있을까?

1.1.1 기계 학습의 정의

인공지능이란? ; 인간의 학습, 추론, 지각, 자연언어 이해 등의 지능적 능력을 기기로 실현한 기술

학습이란? ; 경험의 결과로 나타나는, 비교적 지속적인 행동의 변화나 그 잠재력의 변화..지식을 습득하는 과정

기계학습이란???
초창기 정의 : 컴퓨터가 경험들 통해 학습할 수 있도록 프로그래밍 할 수 있는 것?
현대적 정의 : 프로그램이 작업을 수행했을 떄 성능이 점진적으로 좋아지는 것 = 최적의 프로그램(알고리즘), 경험(E)를 통해 주어진 작업(T)에 대한 성능(P)의 향상

Ⅲ. 신경망의 기초 - 기계학습 2

Ⅳ. 신경망의 기초 - 기계학습 3

"""