#장고
"""""""""
파이썬 기반 웹프레임워크임

-플라스크와 차이점 : 지향성이 다름, 둘이 추구하고자 하는 바가 다름. 플라스크는 항상 마이크로라는 말이 붙는다
마이크로는 작다,. 즉 최소한의 기능
반면에 장고는 모든 것이 내장되어
플라스크는 작은 프로젝트, 장고는 큰 프로젝

-장고의 구성요소
장고는 다양한 파일로 구성되어 있다.
바깥에 ㅍ매니지 파잃은 장고를 실행하는 파일이다.
하위폴도에 다양한 파일이있다
1이닛은 파이썬 모듈로써 인식하게 담당
asgi는 실제 가동할때 다루게 되는부분
세팅와 유알에슬를 가장 많이 봄
세팅스는 전반적인 설정파일을 담당하게된다
시크릿 키도 있다, 디버그라는 변수가 있어서 트루라면 디버깅모드로 실행
얼라우드 호스트, : 주소를 넣으므로서 우리가 어떤 주소에 대해서 요 장고프로젝트에 접근할수있는지 결정하게 해줌
인스톨앱스 :
여러 앱으로 이루어짐. 앱중에 어떤걸 설치?
미드왜어더 마찬가지리
루
템플렛 : 실제화면에 관한 요소
위스기 애플리 : 소통하는 어플랰ㅇ엿ㄴ?
데이터베이스 : 프로젝트에 필요한 데이터 저장소
어스 패스 : 관리자부분에서 패스워드 관리
스태틱 유알엘 : 이미지같은 정적파일을 어느폴더에 담아줄지 정해주는거

-장고프로젝트 & 앱

한프로젝트는 여러 앱으로 구성되어 있다.
저마다 기능이 있는 걸 앱 단위로 관리
각 기능에 대해 독립적으로 개발할수수있음.

-장고 앱 만들기

-디자인 패턴: mvt패턴 
mvc? ; model view controller?

장고는 mvt

"""""""
